package leetcode.swordtooffer;

//把一个数组最开始的若干个元素搬到数组的末尾，我们称之为数组的旋转。输入一个递增排序的数组的一个旋转，输出旋转数组的最小元素。例如，数组 [3,4,5,1,2
//] 为 [1,2,3,4,5] 的一个旋转，该数组的最小值为1。
//
// 示例 1：
//
// 输入：[3,4,5,1,2]
//输出：1
//
//
// 示例 2：
//
// 输入：[2,2,2,0,1]
//输出：0
//
//
// 注意：本题与主站 154 题相同：https://leetcode-cn.com/problems/find-minimum-in-rotated-sor
//ted-array-ii/
// Related Topics 数组 二分查找
// 👍 353 👎 0
public class MinArray {
    public static int minArray(int[] numbers) {
        int l = 0, r = numbers.length - 1;
        while (l < r) {
            int m = (l + r) >>> 1;
            if (numbers[m] > numbers[r]) {
                // 在 m ~ r 存在递增序列
                l = m + 1;
            } else if (numbers[m] < numbers[r]) {
                // 在 l ~ m 存在递增序列
                r = m;
            } else {
                //不确定递增位置，缩短序列即可
                --r;
            }
        }
        return numbers[l];
    }
}
